var data = [];

var dataStr = '1、气功师<br>\
<br>\
基本信息：<br />\
防具  布甲 <br>\
武器  手套 <br>\
转职与觉醒:<br>\
一次觉醒  百花缭乱 <br>\
二次觉醒  念帝<br>\
修炼念气之力的格斗家。——善用念气感知周围物体，能回避失明等异常状态。——多数技能可以对敌人造成光属性伤害。<br>\
<br>\
<br>\
2、剑魂<br>\
<br>\
基本信息:<br >\
防具	轻甲<br>\
武器	太刀 钝器 巨剑 短剑 光剑<br>\
转职与觉醒:<br>\
一次觉醒	剑圣<br>\
二次觉醒	剑神<br>\
不屈服于鬼神的妨碍，一如既往地修炼自己的宝剑，这不是武道的极限吗？”有这样的一些人。无论是心脏虚弱还是缺少一只腿，他们在任何条件下都不会屈服，勇往直前，向自己特定的目标前进。<br>\
<br>\
<br>\
3、弹药专家<br>\
<br>\
基本信息:<br >\
防具	皮甲<br>\
武器	手弩，步枪<br>\
转职与觉醒:<br>\
一次觉醒	大将军<br>\
二次觉醒	战场统治者<br>\
 弹药专家。他们对枪弹制作有着出色的技巧，他们把枪当作生命，子弹当作粮食般珍惜。对于他们子弹比任何技术都为重要。所以他们与漫游枪手、枪炮师不同，腰部还会带上子弹带。与其他神枪手不同，他们的子弹有着特殊的功能，可以瞬间穿过对手或迅速将敌人火化。<br>\
<br>\
<br>\
4、元素师<br>\
<br>\
基本信息:<br >\
防具	布甲<br>\
武器	法杖<br>\
转职与觉醒:<br>\
一次觉醒	大魔导师<br>\
二次觉醒	元素圣灵<br>\
元素师:把元素之力发挥到极限的正统魔法师。——掌握自然界的冰、火、光、暗四种元素的强大力量；——可以远距离攻击敌人并造成极大伤害。<br>\
<br>\
<br>\
5、忍者<br>\
<br>\
基本信息:<br >\
防具	布甲<br>\
武器	苦无<br>\
转职与觉醒:<br>\
一次觉醒	毕方之炎<br>\
二次觉醒	不知火<br>\
可以使用苦无系列武器攻击敌人， 且基本攻击更变为魔法攻击。使用苦无系列武器时基本攻击、 跳跃攻击和前冲攻击会发射出苦无。若基本攻击中使用后方向键+攻击键时， 则可以往后空翻并投掷苦无。<br>\
<br>\
<br>\
6、漫游枪手（女）<br>\
<br>\
基本信息:<br >\
防具	皮甲<br>\
武器	左轮<br>\
这些比较著名的漫游枪手，从小就拥有优秀的运动神经和精准的枪法，并在来自无法地带的教官的残酷训练下成长。之后她们当中的绝大多数人被纳入国家的秘密组织，执行极其危险的秘密任务或在皇女身边负责警卫工作。<br>\
<br>\
<br>\
7、气功师（男）<br>\
<br>\
基本信息:<br >\
防具	布甲<br>\
武器	手套<br>\
转职与觉醒:<br>\
一次觉醒	狂虎帝<br>\
二次觉醒	念帝<br>\
虚祖禁术——“念气纹身”。<br>\
念气纹身的使用条件非常苛刻，需要耗费大量罕见的材料。而且，放眼整个阿拉德大陆，也只有少数几个纹身施术师和高阶的格斗家才能施展这项禁术。<br>\
<br>\
8、冰结师<br>\
<br>\
基本信息:<br >\
防具	皮甲<br>\
武器	魔杖<br>\
转职与觉醒:<br>\
一次觉醒	冰冻之心<br>\
二次觉醒	刹那永恒<br>\
  将冰系魔法研究到极致，并且可以利用寒冰制造出致命武器的近战型魔法师。<br>\
职业语：<br>\
"我出生的地方由于太寒冷甚至连使徒都不敢来这里，难道是这个原因么?我从小就跟冰相处的很好，难道那时候已经注定我会成为最强冰结师么?"<br>\
<br>\
<br>\
9、黑暗武士<br>\
<br>\
基本信息:<br >\
防具	各种<br>\
武器	各种<br>\
<br>\
<br>\
10、缔造者<br>\
<br>\
基本信息:<br >\
防具	板甲<br>\
武器	扫把<br>\
少女曾经是魔界最强组织——塔拉库沓中的一员，她从小在魔法上就展现出惊人的天赋，<br>\
一直是组织里备受期待的新星，而她也同样没让组织失望，一门心思都花在魔法研究上，<br>\
逐步地向更高的领域迈进。<br>\
<br>\
<br>\
11、暗殿骑士<br>\
<br>\
基本信息:<br >\
防具	板甲<br>\
武器	短剑<br>\
转职与觉醒:<br>\
一次觉醒	暗帝<br>\
二次觉醒	裁决女神<br>\
职业信息<br>\
以乌希尔的力量作为基础，善于吸收敌人的灵魂或者通过影子自由移动来攻击敌人的魔法型剑士<br>\
<br>\
<br>\
12、混沌魔灵<br>\
<br>\
基本信息:<br >\
防具	重甲<br>\
武器	短剑<br>\
转职与觉醒:<br>\
一次觉醒	黑魔后<br>\
二次觉醒	黑曜神<br>\
对强大力量的信念和追求能让她们在孤身涉险的时候也毫无畏惧。<br>\
这种胜利至上的价值观和那些恶魔一模一样，而追求绝对的力量和智谋却是和那些自我毁灭的古泰拉星人如出一辙。<br>\
<br>\
<br>\
13、征战者<br>\
<br>\
基本信息:<br >\
防具	重甲<br>\
武器	战戟<br>\
转职与觉醒:<br>\
一次觉醒	战魂<br>\
二次觉醒	不灭战神<br>\
他们沉醉于魔枪强大的破坏力，唯一的目标就是寻找更加强大的敌人。在生与死的厮杀中淬炼而出的他们被称为“征战者”。<br>\
<br>\
<br>\
14、刺客<br>\
<br>\
基本信息:<br >\
防具	皮甲<br>\
武器	匕首，双剑<br>\
转职与觉醒:<br>\
一次觉醒	银月<br>\
二次觉醒	月影星劫<br>\
刺客是暗夜使者中唯一直属于王室的间谍组织，这也是刺客们最引以为豪的地方。而刺客们对那些没有获得公认的暗夜使者，一直都不太认可。<br>\
刺客的主要任务是收集其它种族以及各国家的情报，以便暗精灵统治者掌握外交主动权。<br>\
<br>\
<br>\
15、枪炮师<br>\
<br>\
基本信息:<br >\
防具	重甲<br>\
武器	手炮<br>\
转职与觉醒:<br>\
一次觉醒	狂暴者<br>\
二次觉醒	毁灭者<br>\
在同伙进行战斗时，枪炮师可以成为很好的帮手。因为使用制导武器，因此在隐蔽的地方也可以发射武器，在战斗中他们是非常受欢迎的职业。<br>\
枪炮师可以使用激光跑炮,狙击枪,坦克炮等重火器，它是破坏机械的最好职业。<br>\
<br>\
<br>\
16、战斗法师<br>\
<br>\
基本信息:<br >\
防具	皮甲<br>\
武器	矛，棍棒<br>\
转职与觉醒:<br>\
一次觉醒	贝亚娜斗神<br>\
二次觉醒	伊斯塔战灵<br>\
战斗法师<br>\
为在混乱的世界生存，不断修炼自身且努力学习各种近战技能的魔法师。——可以将自身的魔法力量转变成各种属性的炫纹攻击敌人。<br>\
<br>\
<br>\
17、圣骑士<br>\
<br>\
基本信息:<br >\
防具	板甲<br>\
武器	十字架<br>\
转职与觉醒:<br>\
一次觉醒	天启者<br>\
二次觉醒	神思者<br>\
圣骑士是唯一能在战斗中帮助队友快速恢复的职业，战场上的多面手。其强大的增益状态技也备受青睐。<br>\
圣骑士们始终扮演着守护者的身份，他们无私的奉献着自己的圣光之力，挽救了无数的生命。只要一提及他们的名号，冒险者们都会肃然起敬。<br>\
<br>\
<br>\
18、死灵术士<br>\
<br>\
基本信息:<br >\
防具	轻甲<br>\
武器	权杖<br>\
转职与觉醒:<br>\
一次觉醒	灵魂收割者<br>\
二次觉醒	亡魂主宰<br>\
普通的死灵术士，一般是使用没有人格的普通灵魂诅咒敌人。但有一部分死灵术士，能使古代暗精灵之王巴拉克的灵魂附于自身，从而获得极其强大的战斗力。<br>\
<br>\
<br>\
19、散打<br>\
<br>\
基本信息:<br >\
防具	轻甲<br>\
武器	拳套<br>\
转职与觉醒:<br>\
一次觉醒	武极<br>\
二次觉醒	极武皇<br>\
散打<br>\
挖掘身体各部位机能，追求肉体力量巅峰的正统格斗达人。——掌握暴击技能，可以增加自身暴击率和减少敌人回避率。——可以使用拳套和指定敌人的弱点。<br>\
<br>\
<br>\
20、血法师<br>\
<br>\
基本信息:<br >\
防具	皮甲<br>\
武器	长矛<br>\
转职与觉醒:<br>\
一次觉醒	吸血鬼<br>\
二次觉醒	吸血鬼王<br>\
少年的今天依旧从悲鸣中开始<br>\
忍受失败进行的一直，已无后悔的余地<br>\
但在眼前即将到来的死亡所带来的噩梦面前，少年还是倒下了<br>\
';

var d = dataStr.split('<br><br><br>')
  for (var i=0; i < d.length; i++) {
  	var c = d[i].split('<br><br>');
  	data.push ({
  		img : c[0].replace('、','') + '.jpg',
  		caption : c[0].split('、')[1],
  		desc : c[1]
  	});
  	console.log(c[0].replace('、','') +'.jpg');
  }